#### «Национальный исследовательский университет ИТМО»
### Программирование
## Лабораторная работа 1
## Вариант 367945
### Бутвин Михаил, P3130
###  2022
----
<div style="page-break-after: always;"></div>


## Задание 

Написать программу на языке Java, выполняющую соответствующие варианту действия. Программа должна соответствовать следующим требованиям:

- Она должна быть упакована в исполняемый jar-архив.
- Выражение должно вычисляться в соответствии с правилами вычисления математических выражений (должен соблюдаться порядок выполнения действий и т.д.).
- Программа должна использовать математические функции из стандартной библиотеки Java.
- Результат вычисления выражения должен быть выведен в стандартный поток вывода в заданном формате.
Выполнение программы необходимо продемонстрировать на сервере helios.

1. Создать одномерный массив a типа short. Заполнить его числами от 2 до 17 включительно в порядке возрастания.
2. Создать одномерный массив x типа float. Заполнить его 20-ю случайными числами в диапазоне от -9.0 до 9.0.
3. Создать двумерный массив a размером 16x20. Вычислить его элементы по следующей формуле (где x = x[j]):
    - если a[i] = 9, то a[i][j] = ((1/4/(1/3/(0.5+x))^3)^2/3/4)^2
    - если a[i] ∈ {2, 3, 6, 7, 10, 13, 14, 15}, то a[i][j] = (3/(arcsin(1/3*x/18)+1/4))^(arctan(cos(x)))+14)arctan(cos(x));
    - для остальных значений a[i][j] = ln((4+abs(arcsin(cos(x))))^2)
4. Напечатать полученный в результате массив в формате с двумя знаками после запятой.

## Код программы

    import java.util.Arrays;
    import static java.lang.Math.*;

    public class Lab0 {
        public static void main(String[] args) {
            short[] c = new short[16];
            for (short i = 2; i <= 17; i++) {
                c[i - 2] = i;
            }

            float[] xx = new float[20];
            for (int i = 0; i < 20; i++) {
                xx[i] = (float) random() * 18 - 9;
            }

            double[][] cc = new double[16][20];
            short[] corr_c = { 2, 3, 6, 7, 10, 13, 14, 15 };

            for (int i = 0; i < 16; i++) {
                for (int j = 0; j < 20; j++) {
                    float x = xx[j];
                    if (c[i] == 9) {
                        cc[i][j] = pow((pow((pow((1 / 4.0) / ((1 / 3.0) / (0.5 + x)), 3)), 2) / 3.0 / 4.0), 2);
                    } else if (Arrays.binarySearch(corr_c, c[i]) >= 0) {
                        cc[i][j] = pow((3.0 / (asin(1 / 3.0 * x / 18.0) + (1 / 4.0))), (atan(cos(x))));
                    } else {
                        cc[i][j] = log(pow((4.0 + abs(asin(cos(x)))), 2));
                    }
                    System.out.printf("%.2f\t", cc[i][j]);
                }
                System.out.println();
            }
        }
    }


## Результат выполнения

    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    3,06    3,15    2,92    3,29    3,40    3,32    3,06    3,24    2,91    3,41    3,04    2,93    2,96    3,27    3,02    3,04    3,01    3,08    3,36    2,93
    3,06    3,15    2,92    3,29    3,40    3,32    3,06    3,24    2,91    3,41    3,04    2,93    2,96    3,27    3,02    3,04    3,01    3,08    3,36    2,93
    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    3,06    3,15    2,92    3,29    3,40    3,32    3,06    3,24    2,91    3,41    3,04    2,93    2,96    3,27    3,02    3,04    3,01    3,08    3,36    2,93
    34711,55        0,47    39300515,12     4020,08 0,00    96,09   14502931,12     198,81  8615475,92      0,00    0,08    8,00    0,02    30250376,76     20,72   32474,13        1529,22 0,00    58,92   2632,08
    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    3,06    3,15    2,92    3,29    3,40    3,32    3,06    3,24    2,91    3,41    3,04    2,93    2,96    3,27    3,02    3,04    3,01    3,08    3,36    2,93
    3,06    3,15    2,92    3,29    3,40    3,32    3,06    3,24    2,91    3,41    3,04    2,93    2,96    3,27    3,02    3,04    3,01    3,08    3,36    2,93
    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    4,72    0,18    0,55    0,19    6,97    0,12    0,16    0,19    0,40    6,99    0,27    0,48    0,39    0,07    0,34    4,48    0,28    4,05    0,12    0,41
    3,06    3,15    2,92    3,29    3,40    3,32    3,06    3,24    2,91    3,41    3,04    2,93    2,96    3,27    3,02    3,04    3,01    3,08    3,36    2,93
    3,06    3,15    2,92    3,29    3,40    3,32    3,06    3,24    2,91    3,41    3,04    2,93    2,96    3,27    3,02    3,04    3,01    3,08    3,36    2,93


## Вывод
В ходе выполнения задания я познакомился с базовым синтаксисом Java, типами данных, модулем Math, классом Arrays